test/moveDynamicMesh/original/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

canCompile || exit 0    # Dynamic code

runApplication blockMesh

runApplication topoSet

runApplication subsetMesh -overwrite c0 -patch wec

restore0Dir

runApplication moveDynamicMesh